# 10월 17일 숙제
> 행 열 삭제

- toc: true
- branch: master
- badges: true
- comments: true
- author: 김혜지
- categories: [python]

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
df = pd.DataFrame({'a':[1,2,3,4],'b':[2,3,4,5],'c':[3,4,5,6],'d':[4,5,6,7]})
df

   a  b  c  d
0  1  2  3  4
1  2  3  4  5
2  3  4  5  6
3  4  5  6  7

아래의 결과를 관찰하고 drop의 기능을 유추하라.

(예시1)

In [3]:
df.drop(columns='a')

   b  c  d
0  2  3  4
1  3  4  5
2  4  5  6
3  5  6  7

In [4]:
df.drop(columns=['a','b'])

   c  d
0  3  4
1  4  5
2  5  6
3  6  7

- drop(columns=)는 열을 삭제해 준다

In [5]:
df.drop(index=0)

   a  b  c  d
1  2  3  4  5
2  3  4  5  6
3  4  5  6  7

In [6]:
df.drop(index=range(2,4))

   a  b  c  d
0  1  2  3  4
1  2  3  4  5

- drop(index=)는 행을 삭제해 준다.

**문제: df 에서 a,c열을 삭제하고 첫행을 삭제하라.**

In [8]:
df.drop(columns = ['a', 'c'], index = 0)

   b  d
1  3  5
2  4  6
3  5  7